tap "caskroom/cask"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
# Graphical system information display for macOS
brew "archey"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# Vector graphics library with cross-device output support
brew "cairo"
# Arbitrary precision calculator
brew "calc"
# Dependency manager for Cocoa projects
brew "cocoapods", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Message bus system, providing inter-application communication
brew "dbus"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line tool to interact with exercism.io
brew "exercism"
# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Graphics library to dynamically manipulate images
brew "gd"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Fulltext search engine and column store
brew "groonga"
# Website copier/offline browser
brew "httrack"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Network authentication protocol
brew "krb5"
# Audio and video processing tools
brew "libav"
# Asynchronous event library
brew "libev"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Library to Access SMI MIB Information
brew "libsmi"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# GNOME XML library
brew "libxml2"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# DNS benchmark utility
brew "namebench"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Object-relational database system
brew "postgresql"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
cask "appcleaner"
cask "calibre"
cask "dash"
cask "dozer"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "qbittorrent"
cask "spotify"
cask "spotmenu"
cask "the-unarchiver"
cask "virtualbox"
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Coin Tick", id: 1141688067
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Parallels Desktop", id: 1085114709
mas "SnippetsLab", id: 1006087419
mas "Typist", id: 415166115
mas "VOX", id: 461369673
mas "Xcode", id: 497799835
mas "Zen Pinball 2", id: 527953383
