tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "mas-cli/tap"
tap "rigellute/tap"
tap "thefox/brewery"
# Search tool like grep, but optimized for programmers
brew "ack"
# Weather in your terminal, with ANSI colors and Unicode symbols
brew "ansiweather"
# Shell plugin manager
brew "antibody"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision calculator
brew "calc"
# Console Matrix
brew "cmatrix"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Music player with an ncurses based interface
brew "cmus"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Interactive terminal based UI application for tracking cryptocurrencies
brew "cointop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Distributed revision control system
brew "git"
# GNU typing tutor
brew "gnu-typist"
# GNU grep, egrep and fgrep
brew "grep"
# Website copier/offline browser
brew "httrack"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Rainbows and unicorns in your console!
brew "lolcat"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Command-line interface for SQLite
brew "sqlite"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Application uninstaller
cask "appcleaner"
# E-books management software
cask "calibre"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Free and open-source image editor
cask "gimp"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "a-h.templ"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-complete-tag"
vscode "golang.go"
vscode "jinliming2.vscode-go-template"
vscode "ms-vscode.js-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
