tap "caskroom/cask"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "mas-cli/tap"
brew "archey"
brew "bash"
brew "bash-completion"
brew "bat"
brew "sqlite"
brew "calc"
brew "cocoapods", link: false
brew "coreutils"
brew "dbus"
brew "emacs"
brew "exercism"
brew "fdk-aac"
brew "ffmpeg"
brew "findutils"
brew "geoip"
brew "git"
brew "gnuplot"
brew "grep"
brew "mecab"
brew "mecab-ipadic"
brew "msgpack"
brew "groonga"
brew "httrack"
brew "libplist"
brew "ideviceinstaller"
brew "ios-webkit-debug-proxy"
brew "jansson"
brew "jemalloc"
brew "libav"
brew "libev"
brew "libgpg-error"
brew "libgcrypt"
brew "libmaxminddb"
brew "mpfr"
brew "libmpc"
brew "libsmi"
brew "libssh"
brew "libxml2"
brew "lua@5.1"
brew "mariadb"
brew "mas", link: false
brew "micro"
brew "nasm"
brew "nghttp2"
brew "nmap"
brew "ntfs-3g"
brew "postgresql"
brew "protobuf"
brew "rename"
brew "rtv"
brew "speedtest-cli"
brew "stow"
brew "texi2html"
brew "trash"
brew "tree"
brew "unrar"
brew "w3m"
brew "watchman"
brew "wget"
brew "wireshark"
brew "yarn"
brew "yasm"
brew "youtube-dl"
brew "zsh"
brew "getantibody/tap/antibody"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "spotmenu"
cask "virtualbox"
cask "vlc"
mas "Amphetamine", id: 937984704
mas "Coin Tick", id: 1141688067
mas "Keyboard Virtuoso Light", id: 1202560697
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Parallels Desktop", id: 1085114709
mas "SnippetsLab", id: 1006087419
mas "The Unarchiver", id: 425424353
mas "VOX", id: 461369673
mas "Xcode", id: 497799835
mas "Zen Pinball 2", id: 527953383
